1) Perform the following operations using Python on any open source dataset (e.g., data.csv)
1. Import all the required Python Libraries.
2. Provide a clear description of the data and its source.
3. Load the Dataset into pandas dataframe.
4. Data Preprocessing: check for missing values in the data using pandas isnull(), describe()
function to get some initial statistics. Provide variable descriptions. Types of variables etc. 
Check the dimensions of the data frame.
5.Turn categorical variables into quantitative variables in Python.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv("test (1) - test (1).csv")
df.head()

In [4]:
column={} #Creating a column dictionary which 
for x in df.columns:
    column[x] = df[x].isnull().any()#any() function will returns true if missing value false not missing value
print(column)

df.describe() # describe the table

{'PassengerId': False, 'Pclass': False, 'Name': False, 'Sex': False, 'Age': True, 'SibSp': False, 'Parch': False, 'Ticket': False, 'Fare': True, 'Cabin': True, 'Embarked': False}

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [21]:
#Here we filling mean value of age and fare in place of missing value 
df['Age'].fillna(value=df['Age'].mean(),inplace=True) 
df['Fare'].fillna(value=df['Fare'].mean(),inplace=True)
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [18]:
#importing label encoder class from the sklearn.preprocessing librarry which consists of fit_transforms function which converts Name into values
from sklearn.preprocessing import LabelEncoder 
from sklearn.preprocessing import OneHotEncoder
le = LabelEncoder()
df["Name"] = le.fit_transform(df["Name"].values)

In [6]:
df.dtypes

PassengerId      int64
Pclass           int64
Name             int32
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,206,male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,403,female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,269,male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,408,male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,178,female,22.0,1,1,3101298,12.2875,NaN,S

In [22]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
le = LabelEncoder()

df["Age"]=le.fit_transform(df["Age"].values)

In [25]:
df['Age']

0      45
1      61
2      75
3      34
4      27
       ..
413    39
414    52
415    51
416    39
417    39
Name: Age, Length: 418, dtype: int64

In [26]:
df["Name"]

0      206
1      403
2      269
3      408
4      178
      ...
413    353
414    283
415    332
416    384
417    302
Name: Name, Length: 418, dtype: int64

In [27]:
df["Name"]=df["Name"].astype("string")

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    string
 3   Sex          418 non-null    object
 4   Age          418 non-null    int64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(1), int64(5), object(4), string(1)
memory usage: 36.0+ KB

#